In [1]:
import pandas as pd
import numpy as np

In [2]:
# 1. Write a Pandas program to get the powers of an array values element-wise. 

sample = {'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]}
sample_df = pd.DataFrame(sample)
print(sample_df)

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

In [3]:
# 2. Write a Pandas program to create and display a DataFrame from a specified dictionary data which has the 
# index labels.

exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df_exam_data = pd.DataFrame(exam_data, labels)
print(df_exam_data)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [4]:
# 3. Write a Pandas program to display a summary of the basic information about a specified DataFrame and its data. 

df_exam_data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
name        10 non-null object
score       8 non-null float64
attempts    10 non-null int64
qualify     10 non-null object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

In [5]:
# 4. Write a Pandas program to get the first 3 rows of a given DataFrame. 

#Method1:
df_exam_data.head(3)

#Method2:
df_exam_data.iloc[:3]

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

In [6]:
# 5. Write a Pandas program to select the 'name' and 'score' columns from the following DataFrame. 

#Method1:
df_exam_data.iloc[:,:2]

#Method2:
df_exam_data[['name','score']]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

In [7]:
# 6. Write a Pandas program to select the specified columns and rows from a given data frame.

#any specified columns and rows
df_exam_data.iloc[[1,2,6],[2,3]]

   attempts qualify
b         3      no
c         2     yes
g         1     yes

In [8]:
# 7. Write a Pandas program to select the rows where the number of attempts in the examination is greater than 2.

df_exam_data[df_exam_data['attempts'] > 2]

      name  score  attempts qualify
b     Dima    9.0         3      no
d    James    NaN         3      no
f  Michael   20.0         3     yes

In [9]:
# 8. Write a Pandas program to count the number of rows and columns of a DataFrame. 

#To get the names of rows and columns, that is, names in axes
print(df_exam_data.axes)

#Number of axes
print(len(df_exam_data.axes))

#Number of rows 
print(len(df_exam_data.axes[0]))

#Number of columns
print(len(df_exam_data.axes[1]))

[Index(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'], dtype='object'), Index(['name', 'score', 'attempts', 'qualify'], dtype='object')]
2
10
4

In [10]:
# 9. Write a Pandas program to select the rows where the score is missing, i.e. is NaN.

#first checking which values are NaN and then returning those rows
df_exam_data[df_exam_data['score'].isnull()]

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

In [11]:
# 10. Write a Pandas program to select the rows the score is between 15 and 20 (inclusive). 

#Method1:
df_exam_data[df_exam_data['score'].between(15,20)]

#Method2:
df_exam_data[(df_exam_data['score'] >= 15) & (df_exam_data['score'] <= 20)]

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

In [12]:
# 11. Write a Pandas program to select the rows where number of attempts in the examination is less than 2 and score 
# greater than 15.

df_exam_data[(df_exam_data['score'] > 15) & (df_exam_data['attempts'] <2)]

    name  score  attempts qualify
j  Jonas   19.0         1     yes

In [13]:
# 12. Write a Pandas program to change the score in row 'd' to 11.5. 

#loc gets rows (or columns) with particular labels from the index. 
#iloc gets rows (or columns) at particular positions in the index (so it only takes integers).
df_exam_data.loc['d','score'] = 11.5
df_exam_data

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [14]:
# 13. Write a Pandas program to calculate the sum of the examination attempts by the students. 

df_exam_data['attempts'].sum()

19

In [15]:
# 14. Write a Pandas program to calculate the mean score for each different student in DataFrame.

df_exam_data['score'].mean()

13.333333333333334

In [16]:
# 15. Write a Pandas program to append a new row 'k' to data frame with given values for each column. Now delete 
# the new row and return the original DataFrame. 

df_exam_data.loc['k'] = ['Kevin', 12, 1, 'yes']
print(df_exam_data)

df_exam_data.drop('k')

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes
k      Kevin   12.0         1     yes

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [17]:
# 16. Write a Pandas program to sort the DataFrame first by 'name' in descending order, then by 'score' in 
# ascending order. 

df_exam_data.sort_values(by=['name','score'])

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
e      Emily    9.0         2      no
d      James   11.5         3      no
j      Jonas   19.0         1     yes
c  Katherine   16.5         2     yes
i      Kevin    8.0         2      no
k      Kevin   12.0         1     yes
h      Laura    NaN         1      no
g    Matthew   14.5         1     yes
f    Michael   20.0         3     yes

In [18]:
# 17. Write a Pandas program to replace the 'qualify' column contains the values 'yes' and 'no' with True and False. 

df_exam_data['qualify'] = df_exam_data['qualify'].map({'yes':True, 'no':False})
df_exam_data

        name  score  attempts  qualify
a  Anastasia   12.5         1     True
b       Dima    9.0         3    False
c  Katherine   16.5         2     True
d      James   11.5         3    False
e      Emily    9.0         2    False
f    Michael   20.0         3     True
g    Matthew   14.5         1     True
h      Laura    NaN         1    False
i      Kevin    8.0         2    False
j      Jonas   19.0         1     True
k      Kevin   12.0         1     True

In [19]:
# 18. Write a Pandas program to change the name 'James' to 'Suresh' in name column of the DataFrame.

df_exam_data['name'] = df_exam_data['name'].replace('James','Suresh')
df_exam_data

        name  score  attempts  qualify
a  Anastasia   12.5         1     True
b       Dima    9.0         3    False
c  Katherine   16.5         2     True
d     Suresh   11.5         3    False
e      Emily    9.0         2    False
f    Michael   20.0         3     True
g    Matthew   14.5         1     True
h      Laura    NaN         1    False
i      Kevin    8.0         2    False
j      Jonas   19.0         1     True
k      Kevin   12.0         1     True

In [23]:
# 19. Write a Pandas program to delete the 'attempts' column from the DataFrame. 

#Method1:
df_exam_data.drop(['attempts'], axis=1)

        name  score  qualify
a  Anastasia   12.5     True
b       Dima    9.0    False
c  Katherine   16.5     True
d     Suresh   11.5    False
e      Emily    9.0    False
f    Michael   20.0     True
g    Matthew   14.5     True
h      Laura    NaN    False
i      Kevin    8.0    False
j      Jonas   19.0     True
k      Kevin   12.0     True

In [24]:
# 20. Write a Pandas program to insert a new column in existing DataFrame.

df_exam_data['grade'] = ['X','V','VI','IX','VII','VIII','VI','X','X','XI','XII'] 
df_exam_data

        name  score  attempts  qualify grade
a  Anastasia   12.5         1     True     X
b       Dima    9.0         3    False     V
c  Katherine   16.5         2     True    VI
d     Suresh   11.5         3    False    IX
e      Emily    9.0         2    False   VII
f    Michael   20.0         3     True  VIII
g    Matthew   14.5         1     True    VI
h      Laura    NaN         1    False     X
i      Kevin    8.0         2    False     X
j      Jonas   19.0         1     True    XI
k      Kevin   12.0         1     True   XII

In [37]:
# 21. Write a Pandas program to iterate over rows in a DataFrame.

for row in df_exam_data.iterrows():
    print(row)

('a', name        Anastasia
score            12.5
attempts            1
qualify          True
grade               X
Name: a, dtype: object)
('b', name         Dima
score           9
attempts        3
qualify     False
grade           V
Name: b, dtype: object)
('c', name        Katherine
score            16.5
attempts            2
qualify          True
grade              VI
Name: c, dtype: object)
('d', name        Suresh
score         11.5
attempts         3
qualify      False
grade           IX
Name: d, dtype: object)
('e', name        Emily
score           9
attempts        2
qualify     False
grade         VII
Name: e, dtype: object)
('f', name        Michael
score            20
attempts          3
qualify        True
grade          VIII
Name: f, dtype: object)
('g', name        Matthew
score          14.5
attempts          1
qualify        True
grade            VI
Name: g, dtype: object)
('h', name        Laura
score         NaN
attempts        1
qualify     False
grade           X
Name: h, dtype: object)
('i', name        Kevin
score           8
attempts        2
qualify     False
grade           X
Name: i, dtype: object)
('j', name        Jonas
score          19
attempts        1
qualify      True
grade          XI
Name: j, dtype: object)
('k', name        Kevin
score          12
attempts        1
qualify      True
grade         XII
Name: k, dtype: object)